GHB2/src/InformationRegisters/гхб_РаспределениеДоступовВПомещения/гхб_РаспределениеДоступовВПомещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_РаспределениеДоступовВПомещения</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>ЮридическоеЛицоСобственник</name>
    <type>
      <types>CatalogRef.гхб_ОрганизацииБазХолдинга</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеЛицоРаспорядитель</name>
    <type>
      <types>CatalogRef.гхб_ОрганизацииБазХолдинга</types>
    </type>
  </attributes>
  <attributes>
    <name>ДивизионРаспорядитель</name>
    <type>
      <types>CatalogRef.гхб_Дивизионы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДепартаментРаспорядитель</name>
    <type>
      <types>CatalogRef.гхб_ПодразделенияОрганизацийБазХолдинга</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическиеЛицаВПомещении</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДивизионыВПомещении</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДепартаментыВПомещении</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/InformationRegisters/гхб_РаспределениеДоступовВПомещения/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВернутьДанныеПоПомещению(_Помещение) Экспорт 
	
	_Структура = Новый Структура();
	_Структура.Вставить("Помещение", );
	_Структура.Вставить("ЮридическоеЛицоСобственник", Справочники.гхб_ОрганизацииБазХолдинга.ПустаяСсылка());
	_Структура.Вставить("ЮридическоеЛицоРаспорядитель", Справочники.гхб_ОрганизацииБазХолдинга.ПустаяСсылка());
	_Структура.Вставить("ДивизионРаспорядитель", Справочники.гхб_Дивизионы.ПустаяСсылка());
	_Структура.Вставить("ДепартаментРаспорядитель", Справочники.гхб_ПодразделенияОрганизацийБазХолдинга.ПустаяСсылка());
	_Структура.Вставить("ЮридическиеЛицаВПомещении", "");
	_Структура.Вставить("ДивизионыВПомещении", "");
	_Структура.Вставить("ДепартаментыВПомещении", "");
	
	Если ЗначениеЗаполнено(_Помещение) Тогда
	
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		               |	гхб_РаспределениеДоступовВПомещенияСрезПоследних.Помещение КАК Помещение,
		               |	гхб_РаспределениеДоступовВПомещенияСрезПоследних.ЮридическоеЛицоСобственник КАК ЮридическоеЛицоСобственник,
		               |	гхб_РаспределениеДоступовВПомещенияСрезПоследних.ЮридическоеЛицоРаспорядитель КАК ЮридическоеЛицоРаспорядитель,
		               |	гхб_РаспределениеДоступовВПомещенияСрезПоследних.ДивизионРаспорядитель КАК ДивизионРаспорядитель,
		               |	гхб_РаспределениеДоступовВПомещенияСрезПоследних.ДепартаментРаспорядитель КАК ДепартаментРаспорядитель,
		               |	гхб_РаспределениеДоступовВПомещенияСрезПоследних.ЮридическиеЛицаВПомещении КАК ЮридическиеЛицаВПомещении,
		               |	гхб_РаспределениеДоступовВПомещенияСрезПоследних.ДивизионыВПомещении КАК ДивизионыВПомещении,
		               |	гхб_РаспределениеДоступовВПомещенияСрезПоследних.ДепартаментыВПомещении КАК ДепартаментыВПомещении
		               |ИЗ
		               |	РегистрСведений.гхб_РаспределениеДоступовВПомещения.СрезПоследних(, Помещение = &Помещение) КАК гхб_РаспределениеДоступовВПомещенияСрезПоследних";
		
		Запрос.УстановитьПараметр("Помещение", _Помещение);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(_Структура, Выборка);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат _Структура;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
